Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེ་ལ་ཤེས་རབ་ནི་གང་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱི་དོན་ནི་གང་ཞེ་ན། ཤེས་རབ་ཅེས་བྱ་བ་ནི་དགེ་བ་དང་མི་དགེ་བའི་ཆོས་རྣམས་རབ་ཏུ་ཤེས་པའོ། ། ཤེས་རབ་ནི་ངེས་པར་འབྱེད་པའི་ཆ་དང་འཐུན་པའི་ཆོས་རྣམས་ཀྱི་མངོན་སུམ་མོ། ། འཕགས་པའི་ཆོས་མངོན་སུམ་དུ་གྱུར་པའི་ཕྱིར་ཚད་མར་གྱུར་པ་ནི་ཤེས་རབ་བོ། །ཆོས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པའི་ཕྱིར་ཚད་མར་གྱུར་པའོ། ། ཤེས་རབ་ནི་ལྟ་བར་གྱུར་པ་ཐམས་ཅད་དང་། ཀུན་ནས་ལྡང་བ་དང་། སྒྲིབ་པ་དང་། སྒྲིབ་པར་བྱེད་པའི་ཆོས་རྣམས་རབ་ཏུ་རྟོགས་པའོ། ། ཤེས་རབ་ནི་འདོད་པ་དང་། ཚོལ་བ་དང་། སྨོན་ལམ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་དང་བྲལ་བའོ། ། ཤེས་རབ་ནི་ཤིན་ཏུ་སྦྱངས་པའི་ཕྱིར་སིམ་པར་བྱེད་པའོ། ། ཤེས་རབ་ནི་ཆོས་ཀྱི་དགའ་བ་ལ་དམིགས་པ་རྣམ་པར་མི་གཅོད་པའི་ཕྱིར་རབ་ཏུ་དགའ་བར་བྱེད་པའོ། ། ཤེས་རབ་ནི་ཡེ་ཤེས་ཐམས་ཅད་མངོན་སུམ་དུ་གྱུར་པའི་ཕྱིར་རྟེན་པའོ། ། ཤེས་རབ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་གནས་སོ། ། ཤེས་རབ་ནི་ཐེག་པ་ཇི་ལྟ་བ་བཞིན་གྱི་འབྲས་བུ་རྟོགས་པའི་ཕྱིར་ཐོབ་པའི་མཚན་ཉིད་དོ། ། ཤེས་རབ་ནི་རང་བཞིན་གྱིས་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཤེས་པའི་མཚན་ཉིད་དོ། ། ཤེས་རབ་ནི་ཆུ་བོ་ཐམས་ཅད་ལས་སྒྲོལ་བའི་ཕྱིར་རབ་ཏུ་སྒྲོལ་བའོ། ། ཤེས་རབ་ནི་ཡང་དག་པར་གྱུར་པ་ལ་འདྲེན་པའོ། ། ཤེས་རབ་ནི་དགེ་བའི་ཆོས་ཐམས་ཅད་རབ་ཏུ་འཛིན་པའོ། ། ཤེས་རབ་ནི་ཉོན་མོངས་པའི་བག་ལ་ཉལ་ཐམས་ཅད་དང་བར་བྱེད་པའོ། ། ཤེས་རབ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་སྤྱི་བོ་ཐོབ་པའི་མཆོག་གོ ། ཤེས་རབ་ནི་རང་འབྱུང་བའི་ཡེ་ཤེས་རྟོགས་པར་བྱ་བ་ལ་དམ་པའོ། ། ཤེས་རབ་ནི་ཁམས་གསུམ་དང་མ་འདྲེས་པས་རྒྱུ་བ་དང་བྲལ་བའོ། ། ཤེས་རབ་ནི་འཕགས་པ་ཐམས་ཅད་ཀྱིས་ཤིན་ཏུ་བཟུང་བའོ། ། ཤེས་རབ་ནི་མཚན་མར་ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་སྤངས་པས་སྨོན་ལམ་རྣམ་པར་ཆད་པའོ། ། ཤེས་རབ་ནི་མུན་པ་མུན་གནག་དང་བྲལ་བས་བག་མེད་པའི་གཉེན་པོའོ། ། ཤེས་རབ་ནི་རྣལ་འབྱོར་སྤྱོད་པའི་ས་ལ་གནས་པ་ཐམས་ཅད་ཀྱི་སྦྱོར་བའོ། ། ཤེས་རབ་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ལམ་ལ་གནས་པ་རྣམས་ཀྱི་རབ་ཏུ་འདྲེན་པའོ། ། ཤེས་རབ་ནི་མ་རིག་པའི་རླུང་གི་མུན་པ་རབ་རིབ་ཀྱི་སྤྲིན་འཇོམས་པར་བྱས་པས་སྣང་བར་བྱེད་པའོ། ། ཤེས་རབ་ནི་མིག་ལ་ཇི་ལྟར་མོས་པ་རྣམས་ཀྱི་མིག་ཐམས་ཅད་སྦྱིན་པར་བྱེད་པའོ། ། ཤེས་རབ་ནི་མིག་དང་གཟུགས་ཀྱི་ལམ་ལས་འདས་པའི་ཕྱིར་ཟག་པ་མེད་པའོ། ། ཤེས་རབ་ནི་དབེན་པ་ལས་བྱུང་བ་དོན་དམ་པའོ། ། ཤེས་རབ་ནི་ཤིན་ཏུ་དུལ་བའི་ཕྱིར་མི་འཁྲུགས་པའོ། ། ཤེས་རབ་ནི་ཡེ་ཤེས་ཀྱི་སྒོའི་སྣང་བའོ། ། ཤེས་རབ་ནི་ཐམས་ཅད་རྒྱུ་བ་མི་ཟད་པའོ། ། ཤེས་རབ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་འཇུག་པར་མཐོང་བའི་ཕྱིར་འགལ་བ་མེད་པའོ། ། ཤེས་རབ་ནི་ལེན་པའི་འཆིང་བ་ཐམས་ཅད་གཅོད་པར་བྱེད་པས་ཐར་པའི་ལམ་མོ། ། ཤེས་རབ་ནི་སྒྲིབ་པར་བྱེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་དང་ལྷན་ཅིག་ཏུ་མི་གནས་པས་མ་འདྲེས་པའོ། །
en: “What is ‘wisdom’ here, and what is the purpose of the perfections? Wisdom refers to understanding what is wholesome and what is unwholesome. Wisdom is direct perception of what is conducive to insight. Wisdom is a valid means of knowledge, as it directly perceives noble qualities. Wisdom sees all viewpoints, all patterns, all hindrances, and all obstructions for exactly what they are. Wisdom is freedom from the longing involved in all desires, goals, and aspirations. Wisdom is a cause of pleasure, as it removes all anguish. Wisdom is a cause of joy as it does not sever the object of delight in the Dharma. Wisdom is a support, as it provides direct access to all knowledge. Wisdom is the foundation of all the elements that are conducive to awakening. Wisdom is characterized by attainment, as it leads to the realization of the goals of the different vehicles. Wisdom is characterized by thorough insight into naturally manifesting knowledge. Wisdom is liberating, as it rescues one from all rivers. Wisdom is a guide that brings one safely to what is perfect. Wisdom takes hold of all wholesome qualities. Wisdom is the purification of all ingrained vices. Wisdom is the best of all the highest attainments of the Dharma. Wisdom is the supreme approach to the realization of self-arisen knowledge. Wisdom is beyond any process, as it is not mixed up with the three realms. Wisdom is what is taken up by all the noble ones. Wisdom cuts off longing, as it removes all attributes. Wisdom is the enemy of inattentiveness, as it is free from all ignorance, darkness, and blindness. Wisdom is how all those who have attained the various stages of spiritual practice apply themselves. Wisdom is a guide for all those who travel the path to omniscient knowledge. Wisdom illuminates by clearing away the veil of obscuration, the looming flood of ignorance. Wisdom bestows sight on all according to the kind of sight they wish for. Wisdom is not situated anywhere, as it transcends the realm of eyesight and form. Wisdom is the ultimate objective, as it derives from truth. Wisdom is unshakable, as it derives from thorough training. Wisdom appears through the door of knowledge. Wisdom is imperishable, as it penetrates everywhere. Wisdom cannot be obstructed, as it is the vision that engages with dependent origination. Wisdom is the way to liberation, as it severs all bonds of grasping. Wisdom is not mixed up with any of the vices. Wisdom is unassociated, and it cannot remain where there are any obstructions.

source: ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་ཇི་སྙེད་པ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ལས་དང་། ཡེ་ཤེས་ཀྱི་སྤྱོད་པ་ཡང་དེ་སྙེད་དོ། ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་སྙེད་པ་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱི་སྤྱོད་པ་དང་ཡེ་ཤེས་ཀྱང་དེ་སྙེད་དོ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་སྒོ་ཇི་སྙེད་པ་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ལ་འཇུག་པའི་སྒོ་ཡང་དེ་སྙེད་དོ། ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཡོངས་སུ་ཤེས་པ་ཇི་སྙེད་པ་ཤེས་རབ་གནས་པའི་གནས་ཀྱང་དེ་སྙེད་དེ། བྱང་ཆུབ་སེམས་དཔས་ཐམས་ཅད་ལ་བསླབ་པར་བྱ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཅེས་བྱའོ། །
en: “Thus, Śāriputra, the acts of wisdom and the acts of knowledge of bodhisatvas are as numerous and varied as the many ways in which sentient beings think and act. Whatever the inclinations of sentient beings may be, the bodhisatva can match them with his wisdom, his capacity for investigation, and his knowledge. No matter how sentient beings approach the vices, the bodhisatva will have a way to relate to them by means of wisdom. Whatever insight all the śrāvakas, pratyekabuddhas, and fully accomplished buddhas may have attained, the bodhisatva will study these statements on wisdom in every situation. This is what is known as the wisdom of the bodhisatva.

source: དེ་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་གང་ཞེ་ན། ཤེས་རབ་གང་ཡིན་པ་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཀྱང་དེ་ཡིན་ཏེ། དགེ་བའི་ཆོས་རྣམས་རབ་ཏུ་ཤེས་པ་དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཞེས་བྱའོ། ། གོང་མ་བཞིན་དུ་སྦྱར་ཏེ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་ཚིག་ཀྱང་དེ་བཞིན་དུ་དཔྱད་པར་བྱའོ། ། གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཁྱད་པར་ཡོངས་སུ་རྫོགས་པའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། གཞན་ཡང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། འདུས་བྱས་དང་འདུས་མ་བྱས་པའི་ཆོས་ལ་མངོན་པར་མ་ཆགས་པའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། འཁོར་བའི་ཉེས་པ་ཁོང་དུ་ཆུད་པའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། ཟད་མི་ཤེས་པའི་ཆོས་ཀྱི་མཛོད་སྟོན་པའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། སྒྲིབ་པ་མེད་པའི་རྣམ་པར་ཐར་པ་ཡོངས་སུ་རྫོགས་པའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། སྦྱིན་པ་མཉམ་པ་ཉིད་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་མཉམ་པ་ཉིད་རྟོགས་པའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། རྣམ་པར་ངེས་པའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཁམས་ལ་འཇུག་པའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཡོངས་སུ་རྫོགས་པའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། ཕྱིར་མི་ལྡོག་པའི་ས་ཡོངས་སུ་རྫོགས་པའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་རྫོགས་པའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ཡང་དག་པར་ཐོབ་པའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། བདུད་ཐམས་ཅད་རབ་ཏུ་བཏུལ་བའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། ། གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་གཞོག་པར་བྱེད་པའི་དོན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཏོ། །
en: “Now, what is the purpose of the perfections? Whatever wisdom is, that is the purpose of the perfections. Understanding what is wholesome is what is meant by ‘the purpose of the perfections.’ Here, all the elements that are relevant when discussing the perfections may be added. In addition, fully completing the exemplary path of the bodhisatva is the purpose of the perfections. Also, fully perfecting the knowledge of omniscience is the purpose of the perfections. Not being attached to the conditioned or the unconditioned is the purpose of the perfections. Gaining an understanding of the shortcomings of cyclic existence is the purpose of the perfections. Revealing the inexhaustible treasury of the teachings is the purpose of the perfections. Fully perfecting unobstructed liberation is the purpose of the perfections. Recognizing the sameness of generosity, morality, patient acceptance, vigor, meditation, and wisdom is the purpose of the perfections. Skill in discerning things is the purpose of the perfections. Operating within all the realms of sentient beings is the purpose of the perfections. Fully perfecting one’s patient acceptance of the fact that phenomena do not arise is the purpose of the perfections. Fully perfecting the stage of irreversibility is the purpose of the perfections. Fully accomplishing buddha fields is the purpose of the perfections. Bringing sentient beings to maturity is the purpose of the perfections. The actual attainment of the seat of awakening is the purpose of the perfections. Completely overcoming all māras is the purpose of the perfections. Fully developing the complete qualities of a buddha is the purpose of the perfections. Moreover, furthering the cycle of teachings contained within The Collected Teachings on the Bodhisatva is the purpose of the perfections.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་བསླབས་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་སོན་པར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་དེ་བས་ན་ཐེག་པ་ཆེན་པོ་ལ་གནས་པའི་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བླང་བར་བྱ། གཟུང་བར་བྱ། བཀླག་པར་བྱ། གཞན་ལ་ཡང་བཤད་པར་བྱ། རྒྱ་ཆེར་རབ་ཏུ་བསྟན་པར་བྱའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཤིན་ཏུ་མཉན། བླངས། བཟུང་། བཀླགས། ཀུན་ཆུབ་པར་བྱས། གཞན་ལ་ཡང་བཤད། རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ན་ཡོན་ཏན་བཅུ་པོ་འདི་དག་འཐོབ་པར་འགྱུར་རོ། །
en: “Śāriputra, as one trains in the cycle of teachings contained within The Collected Teachings on the Bodhisatva, one will accomplish all the perfections. Therefore, Śāriputra, sons and daughters of good family who follow the Mahāyāna should adopt the cycle of teachings contained in The Collected Teachings on the Bodhisatva. They should preserve it, recite it, elucidate it for others, and teach it in great detail. Why should they do this? They should do this, Śāriputra, because when they have studied it conscientiously, preserved it, recited it, mastered it, elucidated it to others, and taught it in great detail, they will gain ten benefits.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཚེ་རབས་གཞན་དུ་འཕོས་ནས་ཀྱང་བཟོའི་གནས་དང་ལས་ཀྱི་གནས་ཐམས་ཅད་ལ་རྟོགས་པར་ཁོང་དུ་ཆུད་པར་འགྱུར། རིགས་མཐོ་ཞིང་བཙུན་པར་འགྱུར། དབང་ཆེ་བར་གྲགས་པར་འགྱུར། ཚིག་བཙུན་པར་འགྱུར། ལོངས་སྤྱོད་ཆེ་བར་འགྱུར། ལྷ་དང་མི་རྣམས་ལ་ཕངས་པར་འགྱུར། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འཐོབ་པར་འགྱུར། ཚངས་པ་འཐོབ་པར་འགྱུར། ཐམས་ཅད་དུ་བྱང་ཆུབ་ཀྱི་སེམས་དང་མི་འབྲལ་བར་འགྱུར་ཏེ། ཡོན་ཏན་གྱི་ཕན་ཡོན་འདི་བཅུ་འཐོབ་པར་འགྱུར་རོ། །
en: “What are these ten benefits? One will gain mastery in all arts and crafts after one has died and journeyed on to future lives. One will be highborn. One will be renowned as a great lord. One’s words will be honored. One will possess great riches. One will be loved by gods and men. One will become a king of the entire world. One will reach the state of Brahmā. One will never be separated from the mind of awakening. These are the ten benefits one will gain.

source: དེ་གཞན་ཡང་ཡོན་ཏན་གྱི་ཕན་ཡོན་བཅུ་འཐོབ་པར་འགྱུར་ཏེ། བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། གཅེར་བུ་པའི་རྩོད་པ་དང་། འདྲེས་པ་མ་ཡིན་པར་འགྱུར་བ་དང་། བདག་ཏུ་མི་ལྟ་བ་དང་། སེམས་ཅན་དུ་མི་ལྟ་བ་དང་། སྲོག་ཏུ་མི་ལྟ་བ་དང་། གང་ཟག་ཏུ་མི་ལྟ་བ་དང་། ཆད་པར་མི་ལྟ་བ་དང་། རྟག་པར་མི་ལྟ་བར་འགྱུར་བ་དང་། དངོས་པོ་ཐམས་ཅད་ལ་མི་ལྟ་བ་དང་། རབ་ཏུ་འབྱུང་བ་ལ་དགའ་བར་སེམས་བསྐྱེད་པ་འཐོབ་པ་དང་། ཐོས་པའི་ཚིག་འབྲུ་མྱུར་དུ་ཁོང་དུ་ཆུད་པར་འགྱུར་བ་སྟེ། ཡོན་ཏན་གྱི་ཕན་ཡོན་བཅུ་པོ་དེ་དག་འཐོབ་པར་འགྱུར་རོ། །
en: “There is a further set of ten benefits one will gain. What are these ten benefits? One will not end up associating with the teachings of the Jains. One will not hold the view of a self or the view of a being, of a life force, of a person, of annihilation, or of permanence. One will not be affected by any object. Rejoicing in renunciation, one will successfully cultivate the mind of awakening. One will quickly understand the statements that one hears. These are the ten benefits one will gain.

source: དེ་གཞན་ཡང་ཡོན་ཏན་གྱི་ཕན་ཡོན་བཅུ་འཐོབ་པར་འགྱུར་ཏེ། བཅུ་གང་ཞེ་ན། དྲན་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། བློ་གྲོས་དང་ལྡན་པར་འགྱུར་བ་དང་། རྟོག་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། མོས་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། ཤེས་རབ་དང་ལྡན་པར་འགྱུར་བ་དང་། དལ་བ་ཕུན་སུམ་ཚོགས་པ་རྙེད་པར་འགྱུར་བ་དང་། ཚེ་རབས་དྲན་པར་འགྱུར་བ་དང་། རང་བཞིན་གྱིས་འདོད་ཆགས་ཆུང་སྟེ། འདོད་ཆགས་བདོ་བ་མ་ཡིན་ལ་དེ་ཤིན་ཏུ་འདོད་ཆགས་ཀྱི་གདུང་བས་ཡོངས་སུ་མི་གདུང་བ་དང་། རང་བཞིན་གྱིས་ཞེ་སྡང་ཆུང་སྟེ། ཞེ་སྡང་བདོ་བ་མ་ཡིན་ལ་དེ་ཤིན་ཏུ་ཞེ་སྡང་གི་གདུང་བས་ཡོངས་སུ་མི་གདུང་བ་དང་། རང་བཞིན་གྱིས་གཏི་མུག་ཆུང་སྟེ། གཏི་མུག་བདོ་བ་མ་ཡིན་ལ་དེ་ཤིན་ཏུ་གཏི་མུག་གི་གདུང་བས་ཡོངས་སུ་གདུང་བར་མི་འགྱུར་བ་སྟེ། ཡོན་ཏན་གྱི་ཕན་ཡོན་བཅུ་པོ་དེ་དག་འཐོབ་པར་འགྱུར་རོ། །
en: “There is a further set of ten benefits one will gain. What are these ten benefits? One will possess mindfulness. One will possess intelligence. One will possess learning. One will possess authority. One will possess wisdom. One will gain freedoms and opportunities. One will remember one’s former lives. One will naturally possess few vices, and one’s desire will not be powerful—one will not have to suffer the agony of fiercely burning desire. One’s anger will naturally diminish, and one’s anger will not be powerful—one will not have to suffer the agony that comes with fits of rage. One’s confusion will diminish, and one’s confusion will not be powerful—one will not have to suffer the agony that comes with excessive confusion. These are the ten benefits one will gain.

source: དེ་གཞན་ཡང་ཡོན་ཏན་གྱི་ཕན་ཡོན་བཅུ་འཐོབ་པར་འགྱུར་ཏེ། བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཤེས་རབ་ངོ་མཚར་དུ་འགྱུར། ཤེས་རབ་མྱུར་བར་འགྱུར། ཤེས་རབ་རྣོ་བར་འགྱུར། ཤེས་རབ་མགྱོགས་པར་འགྱུར། ཤེས་རབ་རྒྱ་ཆེ་བར་འགྱུར། ཤེས་རབ་ཟབ་པར་འགྱུར། ཤེས་རབ་ངེས་པར་འབྱེད་པར་འགྱུར། ཤེས་རབ་མ་ཆགས་པར་འགྱུར། དེ་བཞིན་གཤེགས་པ་མངོན་སུམ་དུ་མཐོང་ཞིང་མཐོང་ནས་ ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་བསྟོད་པ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་ཚུལ་བཞིན་གྱི་ཞུ་བ་ཡོངས་སུ་ཞུ་ཞིང་ཚུལ་བཞིན་གྱི་ཞུ་བ་ཞུས་ནས་ ལན་ལྡོན་པར་འགྱུར་བ་སྟེ། ཡོན་ཏན་གྱི་ཕན་ཡོན་བཅུ་པོ་དེ་དག་འཐོབ་པར་འགྱུར་རོ། །
en: “There is a further set of ten benefits one will gain. What are these ten benefits? One’s wisdom will be incredible. One’s wisdom will be agile. One’s wisdom will be sharp. One’s wisdom will be swift. One’s wisdom will be vast. One’s wisdom will be profound. One’s wisdom will be penetrating. One’s wisdom will be unimpeded. One will meet the Tathāgata face-to-face, and when one has seen him, one will praise him by singing verses. One will ask the Tathāgata a question that is not superficial, and one will receive an answer. These are the ten benefits one will gain.

source: དེ་གཞན་ཡང་ཡོན་ཏན་གྱི་ཕན་ཡོན་བཅུ་འཐོབ་པར་འགྱུར་ཏེ། བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་མཉེས་པར་བྱས་པར་འགྱུར་བ་དང་། བདུད་ཀྱི་བཅིང་བ་ཐམས་ཅད་ལྷོད་པར་བྱས་པར་འགྱུར་བ་དང་། དེས་བདུད་ཐམས་ཅད་ཚར་གཅོད་པར་འགྱུར་བ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་སྨད་པར་འགྱུར་བ་དང་། འདུ་བྱེད་ཐམས་ཅད་དུ་གཏོགས་པ་ལས་ཡིད་བསྐྱོད་པར་འགྱུར་བ་དང་། འགྲོ་བ་ངན་པར་འགྲོ་བའི་ལམ་ཐམས་ཅད་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པར་འགྱུར་བ་དང་། མྱ་ངན་ལས་འདའ་བར་འགྱུར་བའི་ལམ་མངོན་དུ་འགྱུར་བ་དང་། འཁོར་བ་ཐམས་ཅད་ལས་སྒྲོལ་བའི་སྦྱིན་པ་བྱིན་པར་འགྱུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཆོ་གའི་རྗེས་སུ་ཞུགས་པར་འགྱུར་བ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་བཀའི་རྗེས་སུ་ཞུགས་པར་འགྱུར་བ་སྟེ། ཡོན་ཏན་གྱི་ཕན་ཡོན་བཅུ་པོ་དེ་དག་འཐོབ་པར་འགྱུར་རོ། །
en: “There is a further set of ten benefits one will gain. What are these ten benefits? All one’s spiritual friends will be pleased. All Māra’s fetters will be loosened. All māras will be rebuked. All vices will be dismissed. One will not be swayed by any conditioned phenomena. One will turn one’s back on all paths that lead to unfavorable conditions. One will turn toward the paths that lead to nirvāṇa. One will give any gift that will facilitate liberation from cyclic existence. One will abide by the precepts of all the bodhisatvas. One will follow the instructions of all the lords, the buddhas. These are the ten benefits one will gain.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཤིན་ཏུ་མཉན། བླངས། བཟུང་། བཀླགས། ཀུན་ཆུབ་པར་བྱས། གཞན་ལ་ཡང་བཤད་ཅིང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ན་ཡོན་ཏན་གྱི་ཕན་ཡོན་འདི་སྙེད་འཐོབ་པར་འགྱུར་རོ། །
en: “Śāriputra, by conscientiously studying the cycle of teachings contained in The Collected Teachings on the Bodhisatva, by preserving it, reciting it, elucidating it to others, and teaching it in great detail, one will gain all these benefits.”

source: གང་དག་མདོ་སྡེའི་རྒྱལ་པོ་འདི་འཛིན་པ། །མཁས་པ་དེ་དག་ཤེས་རབ་མཐའ་ཡས་འགྱུར། །
en: “The wisdom of those who take This king of sūtras to heart will be limitless.

source: ཆོས་དང་དོན་རྣམས་ལ་ཡང་མཁས་པར་འགྱུར། །
en: They will be experts in meaning and objects of meaning,

source: ཚིག་ཀྱང་ཁྱད་པར་འཕགས་ཤིང་ཡི་གེ་རྫོགས། །
en: And they will also master the intricacies of terminology.

source: གང་ཞིག་མདོ་སྡེའི་རྒྱལ་པོ་འདི་འཛིན་པ། །དེ་ནི་རབ་དགའ་ཤིན་ཏུ་མགུ་སྐྱེས་ནས། ། དགེ་སློང་དེ་ནི་འདིར་ཡང་ཆོས་འཆད་དེ། ། རྟག་ཏུ་ཆོས་ཀྱི་སྦྱིན་པ་བྱེད་པར་འགྱུར། །
en: “Someone who takes this king of sūtras to heart Will give rise to the supreme ultimate joy And so will be a mendicant, teach the Dharma, And always give the gift of Dharma.

source: སེམས་ཅན་རྣམས་ནི་མང་དུ་ཆོས་ཐོས་ནས། །
en: “Beings will learn about all these qualities and say eagerly,

source: ཀྱེ་མའོ་ཡོན་ཏན་ཆེན་པོ་འཆད་བྱེད་པ། །ནམ་ཞིག་བདག་ཅག་འདི་འདྲའི་ཆོས་སྟོན་ཅིང་། །མདོ་སྡེ་འདི་འདྲ་འཛིན་པར་འགྱུར་ཞེས་ཟེར། །
en: ‘Amazing! These qualities that have been revealed are supreme. When will I be able to display such qualities And be known as such a bearer of the sūtras?’

source: གང་དག་དེ་འདྲ་ཤེས་རབ་ལྡན་མཆོག་རྣམས། །ཆོས་རྣམས་གང་ལའང་ཞུམ་པར་མི་འགྱུར་ཏེ། །
en: “Those who possess this kind of excellent wisdom Will not become discouraged in the face of any Dharma teaching.

source: དྲན་དང་ཡེ་ཤེས་ཀྱིས་ནི་འཕགས་པ་དང་། །བླ་ན་མེད་པའི་ཡེ་ཤེས་ཚིག་སྟོན་འགྱུར། །
en: Elevated by mindfulness and knowledge, They propound the unsurpassed words of knowledge.

source: གང་དག་མདོ་སྡེའི་རྒྱལ་པོ་འདི་འཛིན་པ། །དེ་ནི་འཕགས་པས་རྟག་བསྔགས་རྒྱལ་བས་གནང་། །ཆོས་ཚིག་ལེགས་པར་བཤད་པ་ཚོལ་བར་བྱེད། །
en: “Someone who takes this king of sūtras to heart Will search for the well-spoken words of the Dharma, The instructions of the Victorious One that are always praised by the noble ones.

source: དེ་ནི་ཐོས་པས་རྟག་ཏུ་འཕགས་པར་འགྱུར། །
en: When he has heard them, he holds them in high esteem.

source: ཐོས་ནས་དོན་ནི་ཉེ་བར་འཛིན་པར་བྱེད། །
en: “They learn them and ascertain their meaning;

source: ཤེས་རབ་ལྡན་པ་འབྲུལ་མི་སྙེམས་ཏེ། །
en: The wise do not insist on the letter.

source: དོན་ལ་ལྟ་བས་རྟོགས་པ་འཕེལ་བར་འགྱུར། །
en: Instead, they search for the meaning, and their understanding prospers.

source: དེ་ཡི་ཡེ་ཤེས་རྟག་ཏུ་ཚད་མེད་དོ། །
en: Indeed, the knowledge of the Victorious One is forever unlimited.

source: ཡེ་ཤེས་མཐའ་ཡས་དོན་ཀྱང་མཐའ་ཡས་ཏེ། །
en: “Unlimited knowledge of unlimited meaning,

source: སེམས་དཔའ་མཐའ་ཡས་དམ་པའི་དོན་ལ་མཁས། །
en: Unlimited intelligence, and expertise in the ultimate truth—

source: དེ་ཡི་ཡོན་ཏན་ཕྱོགས་དང་ཕྱོགས་སུ་འགྲོ །
en: His qualities extend throughout the ten directions.

source: དེ་ཡི་ཐོས་པའི་ཡོན་ཏན་འདི་དག་གོ །
en: His are the benefits that come from learning.

source: དེ་ཡི་འདོད་ཆགས་ཆུང་ལ་ཞེ་སྡང་ཆུང་། །དེ་ཡི་གཏི་མུག་ཤིན་ཏུ་རབ་ཏུ་ཆུང་། །སེམས་ཀྱང་ཤིན་ཏུ་དགའ་བ་རྙེད་པར་འགྱུར། ། དེ་ཡི་ཐོས་པའི་ཡོན་ཏན་འདི་དག་གོ །
en: “He has little desire, and even less anger. His confusion is utterly negligible. His mind has become utterly pure—His are the benefits that come from learning.

source: ལོངས་སྤྱོད་རྙེད་ནས་རྒྱགས་པར་མི་འགྱུར་ཏེ། །
en: “He does not become excited when he gains wealth

source: འདི་ལ་སྙིང་པོ་ཅི་ཞེས་དོན་ལ་རྟོག །
en: But examines whether it has any essence.

source: ལོངས་སྤྱོད་སྙིང་པོ་མེད་པར་རབ་ཤེས་ནས། །
en: Understanding that there is no lasting essence in wealth,

source: དེ་ནི་ལོངས་སྤྱོད་མི་ལྟ་རབ་ཏུ་འབྱུང་། །
en: He loses interest in it and becomes a renunciant.

source: མངོན་པར་བྱུང་སྟེ་དགོན་པར་གནས། །
en: “As a renunciant he retreats to the wilderness,

source: རྟག་ཏུ་གཡེལ་བ་མེད་པ་དང་། །ཆོས་རྣམས་ཐོས་པས་མི་ངོམས་ཏེ། །
en: And there he never loses heart. He is never content with his studies of the teachings,

source: ཆོས་སྦྱིན་པ་ལ་སེར་སྣ་མེད། །
en: And he is not miserly when it comes to giving the gift of the Dharma.

source: འཇིག་རྟེན་མགོན་པོའི་དྲུང་ཉིད་དུ། །སོང་སྟེ་ཞུ་བ་ཞུ་བྱེད་པས། །དེ་ཕྱིར་དེ་ཡི་ཡེ་ཤེས་འཕེལ། ། དེ་ལ་དཀར་པོ་འབྲི་བ་མེད། །
en: “He presents his questions In the presence of the protector of the world. In this way, his knowledge prospers And his goodness does not diminish.

source: ཤཱ་རིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་བརྩོན་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་དོ། ། དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པ་ཞེས་བྱའོ། ། དེ་ལ་བསྡུ་བའི་དངོས་པོའི་རྗེས་སུ་འཇུག་པ་གང་ཞེ་ན།
en: “This, Śāriputra, is what the bodhisatvas’ perfection of wisdom is like, the perfection of wisdom by means of which bodhisatvas, great beings, practice the way of the bodhisatva. This is what is known as engagement with the perfection of wisdom.

source: འདི་བཞི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསྡུ་བའི་དངོས་པོ་སྟེ། བསྡུ་བའི་དངོས་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཡུན་རིང་པོར་སེམས་ཅན་རྣམས་ཡང་དག་པར་སྡུད་པར་བྱེད་དོ། ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྦྱིན་པ་དང་། སྙན་པར་སྨྲ་བ་དང་། དོན་བྱེད་པ་དང་། དོན་མཚུངས་པ་སྟེ། དེ་དག་ནི་བསྡུ་བའི་དངོས་པོ་བཞི་ཞེས་བྱའོ། །
en: “Now, how does one employ the methods for bringing people together? There are four methods for bringing people together, and through these four methods, bodhisatvas are able to gather sentient beings around them for a long time. What are these four methods? They are generosity, pleasant speech, conscientiousness, and egalitarianism.

source: དེ་ལ་སྦྱིན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཟང་ཟིང་སྦྱིན་པ་དང་། མི་འཇིགས་པ་སྦྱིན་པ་དང་། ཆོས་སྦྱིན་པ་སྟེ། དེ་ནི་སྦྱིན་པའོ། ། དེ་ལ་སྙན་པར་སྨྲ་བ་གང་ཞེ་ན། སློང་བ་དང་། ཆོས་ཉན་པ་ལ་སྙན་པར་སྨྲ་བའོ། ། དེ་ལ་དོན་བྱེད་པ་ནི་བདག་དང་གཞན་གྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། ། དོན་འཐུན་པ་ནི་ཐེག་པ་གང་ལ་ཡོན་ཏན་དུ་འདུ་ཤེས་པའི་ཐེག་པ་དང་། ཆོས་དེ་དག་ལ་འཛིན་པར་བྱེད་པའི་སེམས་ཅན་རྣམས་གཞོག་པའོ། །
en: “What is generosity? It is to give physical objects, to give fearlessness, and to give the Dharma. This is what is known as generosity. What is pleasant speech? It is to address anyone who comes to one with a request, and those who listen to the Dharma, with kindness. What is conscientiousness? It is to fulfill one’s own aims and those of others. What is egalitarianism? It is to help sentient beings take hold of the elements of the Dharma belonging to the vehicle they consider to have the best qualities.

source: གཞན་ཡང་སྦྱིན་པ་ནི་གང་སློང་བ་ལ་ཡིད་དང་བར་བྱེད་པ་སྟེ་དེ་ནི་སྦྱིན་པ་ཞེས་བྱའོ། ། སྙན་པར་སྨྲ་བ་ནི་གང་སློང་བ་རྣམས་ལ་རིམ་གྲོ་བྱེད་པའོ། ། དོན་བྱེད་པ་ནི་གང་གིས་སློང་བ་རྣམས་ཀྱི་དོན་དུ་འགྱུར་བའི་དོན་དེ་ཡོངས་སུ་ཐོབ་པར་བྱེད་པའོ། ། དོན་མཚུངས་པ་ནི་གང་སློང་བ་ལ་དོན་མཚུངས་པའོ། །
en: “Furthermore, generosity is to maintain a pure attitude toward anyone who comes to one with a request. This is what is known as generosity. Pleasant speech is to treat such people with respect. Conscientiousness is to grant whatever they ask for. Egalitarianism is to share their goals.

source: གཞན་ཡང་སྦྱིན་པ་ནི་བསམ་པས་བཏང་བའོ། ། སྙན་པར་སྨྲ་བ་ནི་སྦྱོར་བ་ཡོངས་སུ་ཆད་པའོ། ། དོན་བྱེད་པ་ནི་ལྷག་པའི་བསམ་པ་ལ་འགྱོད་པ་མེད་པའོ། ། དོན་འཐུན་པ་ནི་ཐེག་པ་ཆེན་པོ་ལ་བསྔོ་བའོ། །
en: “Furthermore, generosity is to give with an intention. Pleasant speech is to cut off effort. Conscientiousness is to not regret one’s noble intentions. Egalitarianism is to transform them into the Mahāyāna.
